telespial/telespial-EdgeAI_Smart_Pong_Demo_STMicro_STM32H7S78-DK/stm32_port/src/game/ai.c
#include "game/ai.h"

#include <string.h>

#include "fsl_flash.h"
#include "platform/time_hal.h"

static inline float clampf(float v, float lo, float hi)
{
    if (v < lo) return lo;
    if (v > hi) return hi;
    return v;
}

static inline uint16_t clampu16(uint32_t v, uint16_t hi)
{
    if (v > (uint32_t)hi) return hi;
    return (uint16_t)v;
}

static inline float absf(float v)
{
    return (v < 0.0f) ? -v : v;
}

static inline float sqrtf_approx(float x)
{
    if (x <= 0.0f) return 0.0f;
    float r = x;
    /* Small fixed-iteration Newton step is sufficient for lead scaling. */
    for (int i = 0; i < 4; i++) r = 0.5f * (r + x / r);
    return r;
}

static inline float signf_nonzero(float v)
{
    return (v < 0.0f) ? -1.0f : 1.0f;
}

static inline uint32_t xorshift32(uint32_t x)
{
    x ^= x << 13;
    x ^= x >> 17;
    x ^= x << 5;
    return x;
}

static float rand_f01(pong_game_t *g)
{
    g->rng = xorshift32(g->rng ? g->rng : 1u);
    uint32_t u = (g->rng >> 8) & 0x00FFFFFFu;
    return (float)u * (1.0f / 16777215.0f);
}

static float rand_f(pong_game_t *g, float lo, float hi)
{
    return lo + (hi - lo) * rand_f01(g);
}

#define EDGEAI_LEARN_STORE_MAGIC 0x4C524E31u /* "LRN1" */
#define EDGEAI_LEARN_STORE_VERSION 0x00000002u
#define EDGEAI_LEARN_FLASH_PROGRAM_BYTES 512u
#define EDGEAI_LEARN_DECAY_ALPHA 0.04f
#define EDGEAI_LEARN_EVAL_MIN_SAMPLES 10u
#define EDGEAI_LEARN_GOOD_MISS_RATIO_MAX 0.44f
#define EDGEAI_LEARN_BAD_MISS_RATIO_MIN 0.60f
#define EDGEAI_LEARN_BAD_STREAK_ROLLBACK 2u

typedef struct
{
    uint32_t magic;
    uint32_t version;
    uint32_t crc32;
    ai_learn_profile_t left;
    ai_learn_profile_t right;
    uint32_t reserved[(EDGEAI_LEARN_FLASH_PROGRAM_BYTES - (3u * sizeof(uint32_t)) - (2u * sizeof(ai_learn_profile_t))) /
                      sizeof(uint32_t)];
} ai_learn_store_t;

static ai_learn_store_t s_learn_store = {0u};
static ai_learn_store_t s_last_good_store = {0u};
static bool s_learn_store_dirty = false;
static bool s_last_good_valid = false;
static bool s_flash_ready = false;
static bool s_flash_init_done = false;
static uint32_t s_flash_store_addr = 0u;
static uint32_t s_flash_sector_size = 0u;
static flash_config_t s_flash_cfg;
static uint8_t s_bad_sync_streak = 0u;

static uint32_t ai_store_checksum(const ai_learn_store_t *store)
{
    if (!store) return 0u;
    ai_learn_store_t copy = *store;
    copy.crc32 = 0u;

    const uint8_t *p = (const uint8_t *)&copy;
    uint32_t hash = 2166136261u;
    for (uint32_t i = 0u; i < (uint32_t)sizeof(copy); i++)
    {
        hash ^= p[i];
        hash *= 16777619u;
    }
    return hash;
}

static bool ai_flash_init(void)
{
    if (s_flash_init_done) return s_flash_ready;
    s_flash_init_done = true;

    if (FLASH_Init(&s_flash_cfg) != kStatus_FLASH_Success) return false;

    uint32_t pflash_base = 0u;
    uint32_t pflash_size = 0u;
    uint32_t sector_size = 0u;
    if (FLASH_GetProperty(&s_flash_cfg, kFLASH_PropertyPflashBlockBaseAddr, &pflash_base) != kStatus_FLASH_Success)
        return false;
    if (FLASH_GetProperty(&s_flash_cfg, kFLASH_PropertyPflashTotalSize, &pflash_size) != kStatus_FLASH_Success)
        return false;
    if (FLASH_GetProperty(&s_flash_cfg, kFLASH_PropertyPflashSectorSize, &sector_size) != kStatus_FLASH_Success)
        return false;
    if (sector_size < EDGEAI_LEARN_FLASH_PROGRAM_BYTES || pflash_size < sector_size) return false;

    s_flash_sector_size = sector_size;
    s_flash_store_addr = (pflash_base + pflash_size) - sector_size;
    s_flash_ready = true;
    return true;
}

static bool ai_flash_read_store(ai_learn_store_t *out_store)
{
    if (!out_store) return false;
    if (!ai_flash_init()) return false;

    const ai_learn_store_t *flash_store = (const ai_learn_store_t *)(uintptr_t)s_flash_store_addr;
    if (flash_store->magic != EDGEAI_LEARN_STORE_MAGIC) return false;
    if (flash_store->version != EDGEAI_LEARN_STORE_VERSION) return false;
    if (ai_store_checksum(flash_store) != flash_store->crc32) return false;

    *out_store = *flash_store;
    return true;
}

static bool ai_flash_write_store(const ai_learn_store_t *store)
{
    if (!store) return false;
    if (!ai_flash_init()) return false;

    ai_learn_store_t write_buf;
    memset(&write_buf, 0xFF, sizeof(write_buf));
    write_buf = *store;
    write_buf.crc32 = 0u;
    write_buf.crc32 = ai_store_checksum(&write_buf);

    if (FLASH_Erase(&s_flash_cfg, s_flash_store_addr, s_flash_sector_size, kFLASH_ApiEraseKey) != kStatus_FLASH_Success)
        return false;
    if (FLASH_Program(&s_flash_cfg, s_flash_store_addr, (uint8_t *)&write_buf, sizeof(write_buf)) !=
        kStatus_FLASH_Success)
        return false;

    const ai_learn_store_t *flash_store = (const ai_learn_store_t *)(uintptr_t)s_flash_store_addr;
    return (memcmp(flash_store, &write_buf, sizeof(write_buf)) == 0);
}

static void ai_flash_clear_store(void)
{
    if (!ai_flash_init()) return;
    (void)FLASH_Erase(&s_flash_cfg, s_flash_store_addr, s_flash_sector_size, kFLASH_ApiEraseKey);
}

static ai_learn_profile_t ai_profile_default(void)
{
    ai_learn_profile_t p;
    memset(&p, 0, sizeof(p));
    p.speed_scale = 1.06f;
    p.noise_scale = 0.92f;
    p.lead_scale = 1.05f;
    p.center_bias = 0.0f;
    p.corner_bias = 0.0f;
    p.hits = 0u;
    p.misses = 0u;
    p.last_style = 0u;
    return p;
}

static void ai_profile_clamp(ai_learn_profile_t *p)
{
    if (!p) return;
    p->speed_scale = clampf(p->speed_scale, 0.75f, 1.85f);
    p->noise_scale = clampf(p->noise_scale, 0.40f, 2.20f);
    p->lead_scale = clampf(p->lead_scale, 0.70f, 2.00f);
    p->center_bias = clampf(p->center_bias, -0.35f, 0.35f);
    p->corner_bias = clampf(p->corner_bias, 0.00f, 0.45f);
    if (p->last_style > 3u) p->last_style = 0u;
}

static void ai_profile_decay_toward_default(ai_learn_profile_t *p, float alpha)
{
    if (!p) return;
    ai_learn_profile_t d = ai_profile_default();

    alpha = clampf(alpha, 0.0f, 1.0f);
    p->speed_scale += (d.speed_scale - p->speed_scale) * alpha;
    p->noise_scale += (d.noise_scale - p->noise_scale) * alpha;
    p->lead_scale += (d.lead_scale - p->lead_scale) * alpha;
    p->center_bias += (d.center_bias - p->center_bias) * alpha;
    p->corner_bias += (d.corner_bias - p->corner_bias) * alpha;

